In [1]:
import numpy as np
import pandas as pd

In [2]:
arr = np.random.randint(0,6,(10,4))
df = pd.DataFrame(arr,
                 columns=list('ABCD'))
df

   A  B  C  D
0  5  2  1  5
1  3  2  1  0
2  1  5  3  0
3  2  4  4  0
4  3  1  1  5
5  4  4  4  3
6  2  3  2  4
7  4  5  0  3
8  5  5  2  1
9  4  1  4  2

In [7]:
df.groupby('A').mean()

          B         C         D
A
1  5.000000  3.000000  0.000000
2  3.500000  3.000000  2.000000
3  1.500000  1.000000  2.500000
4  3.333333  2.666667  2.666667
5  3.500000  1.500000  3.000000

In [8]:
df.groupby('A')

In [14]:
for d in df.groupby('A'):
    print(len(d), type(d[0]), type(d[1]))
    print(d[0]);
    print(d[1])
    print('');

2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
1
   A  B  C  D
2  1  5  3  0

2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
2
   A  B  C  D
3  2  4  4  0
6  2  3  2  4

2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
3
   A  B  C  D
1  3  2  1  0
4  3  1  1  5

2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
4
   A  B  C  D
5  4  4  4  3
7  4  5  0  3
9  4  1  4  2

2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
5
   A  B  C  D
0  5  2  1  5
8  5  5  2  1

Hadley Wickham: groupby ~ split, apply, combine

In [18]:
df.groupby('A')[['B','C']].mean()

          B         C
A
1  5.000000  3.000000
2  3.500000  3.000000
3  1.500000  1.000000
4  3.333333  2.666667
5  3.500000  1.500000

In [20]:
for d in df.groupby(['A','B']):
    print(d);
    print("")

((1, 5),    A  B  C  D
2  1  5  3  0)

((2, 3),    A  B  C  D
6  2  3  2  4)

((2, 4),    A  B  C  D
3  2  4  4  0)

((3, 1),    A  B  C  D
4  3  1  1  5)

((3, 2),    A  B  C  D
1  3  2  1  0)

((4, 1),    A  B  C  D
9  4  1  4  2)

((4, 4),    A  B  C  D
5  4  4  4  3)

((4, 5),    A  B  C  D
7  4  5  0  3)

((5, 2),    A  B  C  D
0  5  2  1  5)

((5, 5),    A  B  C  D
8  5  5  2  1)

In [21]:
df.groupby(['A','B']).mean()

     C  D
A B
1 5  3  0
2 3  2  4
  4  4  0
3 1  1  5
  2  1  0
4 1  4  2
  4  4  3
  5  0  3
5 2  1  5
  5  2  1

In [23]:
df.groupby(['A','B']).mean().unstack()

     C                        D
B    1    2    3    4    5    1    2    3    4    5
A
1  NaN  NaN  NaN  NaN  3.0  NaN  NaN  NaN  NaN  0.0
2  NaN  NaN  2.0  4.0  NaN  NaN  NaN  4.0  0.0  NaN
3  1.0  1.0  NaN  NaN  NaN  5.0  0.0  NaN  NaN  NaN
4  4.0  NaN  NaN  4.0  0.0  2.0  NaN  NaN  3.0  3.0
5  NaN  1.0  NaN  NaN  2.0  NaN  5.0  NaN  NaN  1.0

`Groupby.filter()`, `Groupby.transform()`, `Groupby.apply()`

In [30]:
def f(x):
    return (x['B'].mean() > 2)

g = lambda x: x['B'].mean() > 2

df.groupby('A').filter(g)

   A  B  C  D
0  5  2  1  5
2  1  5  3  0
3  2  4  4  0
5  4  4  4  3
6  2  3  2  4
7  4  5  0  3
8  5  5  2  1
9  4  1  4  2

In [32]:
df.groupby('A').transform(lambda x: x-x.mean()) 
### transform happens for each **group** and each **column**

          B         C         D
0 -1.500000 -0.500000  2.000000
1  0.500000  0.000000 -2.500000
2  0.000000  0.000000  0.000000
3  0.500000  1.000000 -2.000000
4 -0.500000  0.000000  2.500000
5  0.666667  1.333333  0.333333
6 -0.500000 -1.000000  2.000000
7  1.666667 -2.666667  0.333333
8  1.500000  0.500000 -2.000000
9 -2.333333  1.333333 -0.666667

In [34]:
df.groupby('A').apply(lambda x: x[['B','C']])

   B  C
0  2  1
1  2  1
2  5  3
3  4  4
4  1  1
5  4  4
6  3  2
7  5  0
8  5  2
9  1  4

In [43]:
df.groupby(['A','B'])['C'].mean().unstack()

B    1    2    3    4    5
A
1  NaN  NaN  NaN  NaN  3.0
2  NaN  NaN  2.0  4.0  NaN
3  1.0  1.0  NaN  NaN  NaN
4  4.0  NaN  NaN  4.0  0.0
5  NaN  1.0  NaN  NaN  2.0

In [47]:
df.pivot_table('C', ### values
               index='A', 
               columns='B',
               aggfunc='mean' ### default value
              )

B    1    2    3    4    5
A
1  NaN  NaN  NaN  NaN  3.0
2  NaN  NaN  2.0  4.0  NaN
3  1.0  1.0  NaN  NaN  NaN
4  4.0  NaN  NaN  4.0  0.0
5  NaN  1.0  NaN  NaN  2.0

In [49]:
import seaborn as sns
### this is installed on CoCalc already
### pip install seaborn --user

In [50]:
data = sns.load_dataset('titanic')

In [53]:
print(data.shape)
print(data.columns)

(891, 15)
Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [54]:
data.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [56]:
(data['sex'] == 'female').sum()

314

In [59]:
data.pivot_table('survived', 
                index='sex', 
                columns='class',
                aggfunc='mean', 
                margins=True)

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [58]:
data.pivot_table?

In [ ]:
arr =

String

In [64]:
'123124241'

'123124241'

In [65]:
list('f13fjiosdf')

['f', '1', '3', 'f', 'j', 'i', 'o', 's', 'd', 'f']

In [66]:
'1' in '1o2ijoi;fjsaoidfj'

True

In [67]:
name = 'Jephian Lin'

In [68]:
name.capitalize()

'Jephian lin'

In [69]:
name.upper()

'JEPHIAN LIN'

In [70]:
name.split()

['Jephian', 'Lin']

In [72]:
'Lee' in name.split()

False

In [75]:
name.startswith('Ja')

False

Regular Expression

In [76]:
import re

In [79]:
re.match('1', '1111111')

In [122]:
re.search('[123]{4,7}', '211141113')

In [88]:
re.search('[123]{4,5}', 'Jephian')

search: find the first occurrance  
match: find the occurence including the first digit

for more information,  
search for 'regular expression' online.

In [94]:
names = pd.Series(['Jephian Lin', 
                  'Mary Wu', 
                  'Bruce Lee',
                  'Jeremy Lin'])

In [99]:
names.str.replace('Lin', 'Lee')

0    Jephian Lee
1        Mary Wu
2      Bruce Lee
3     Jeremy Lee
dtype: object

In [97]:
a = 'Lin'
a.

string method, or string vectorization

In [101]:
names.str.startswith('J')

0     True
1    False
2    False
3     True
dtype: bool

In [103]:
arr = np.random.randn(4,5)
df = pd.DataFrame(arr, 
                 index=names)
df

                    0         1         2         3         4
Jephian Lin -1.226038  0.521665  2.270410 -1.004209 -1.593572
Mary Wu     -0.056484 -0.214535  0.099805 -0.583986 -1.634271
Bruce Lee    0.529726  0.059746  0.978809  1.950887 -0.782669
Jeremy Lin   1.179238  0.259895 -0.252001 -0.005033  1.060460

In [105]:
df.index.str.startswith('J')

array([ True, False, False,  True])

In [107]:
mask = df.index.str.startswith('J')
df.loc[mask, :]

                    0         1         2         3         4
Jephian Lin -1.226038  0.521665  2.270410 -1.004209 -1.593572
Jeremy Lin   1.179238  0.259895 -0.252001 -0.005033  1.060460

In [112]:
names.str.split().str.get(0) ### first name

0    Jephian
1       Mary
2      Bruce
3     Jeremy
dtype: object

In [113]:
names.str.split().str.get(-1) ### last name

0    Lin
1     Wu
2    Lee
3    Lin
dtype: object

In [114]:
names.str.extract('([A-Za-z]+)')

         0
0  Jephian
1     Mary
2    Bruce
3   Jeremy

In [115]:
names

0    Jephian Lin
1        Mary Wu
2      Bruce Lee
3     Jeremy Lin
dtype: object

In [116]:
re.match('a','aaaaa')

In [119]:
re.__version__

'2.2.1'

Aggregation and grouping

In [1]:
import numpy as np
import pandas as pd

In [2]:
arr = np.random.randint(1,6,(10,4))
df = pd.DataFrame(arr, 
                 columns=list('ABCD'))
df

   A  B  C  D
0  3  5  3  5
1  4  1  4  3
2  4  4  5  5
3  5  3  3  5
4  1  2  2  3
5  2  1  1  3
6  2  2  2  1
7  3  4  5  4
8  1  3  3  4
9  3  5  3  3

In [8]:
df.groupby('A').mean()

          B         C    D
A
1  2.500000  2.500000  3.5
2  1.500000  1.500000  2.0
3  4.666667  3.666667  4.0
4  2.500000  4.500000  4.0
5  3.000000  3.000000  5.0

GroupBy object

In [15]:
for d in df.groupby('A'):
    print(type(d), len(d), type(d[0]), type(d[1]))
    print(d[0])
    print(d[1])
    print('')

<class 'tuple'> 2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
1
   A  B  C  D
4  1  2  2  3
8  1  3  3  4

<class 'tuple'> 2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
2
   A  B  C  D
5  2  1  1  3
6  2  2  2  1

<class 'tuple'> 2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
3
   A  B  C  D
0  3  5  3  5
7  3  4  5  4
9  3  5  3  3

<class 'tuple'> 2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
4
   A  B  C  D
1  4  1  4  3
2  4  4  5  5

<class 'tuple'> 2 <class 'int'> <class 'pandas.core.frame.DataFrame'>
5
   A  B  C  D
3  5  3  3  5

In [18]:
df.groupby('A')['B'].mean()

A
1    2.500000
2    1.500000
3    4.666667
4    2.500000
5    3.000000
Name: B, dtype: float64

In [19]:
df.groupby('A')[['B', 'C']].mean()

          B         C
A
1  2.500000  2.500000
2  1.500000  1.500000
3  4.666667  3.666667
4  2.500000  4.500000
5  3.000000  3.000000

In [22]:
df.groupby(['A','B']).mean().unstack()

     C                        D
B    1    2    3    4    5    1    2    3    4    5
A
1  NaN  2.0  3.0  NaN  NaN  NaN  3.0  4.0  NaN  NaN
2  1.0  2.0  NaN  NaN  NaN  3.0  1.0  NaN  NaN  NaN
3  NaN  NaN  NaN  5.0  3.0  NaN  NaN  NaN  4.0  4.0
4  4.0  NaN  NaN  5.0  NaN  3.0  NaN  NaN  5.0  NaN
5  NaN  NaN  3.0  NaN  NaN  NaN  NaN  5.0  NaN  NaN

functions for `GroupBy` objects  
`filter`, `transform`, `apply`

In [27]:
df.groupby('A').filter(lambda x: (x['B'].mean() > 2.5))

   A  B  C  D
0  3  5  3  5
3  5  3  3  5
7  3  4  5  4
9  3  5  3  3

In [26]:
df.groupby('A').mean()

          B         C    D
A
1  2.500000  2.500000  3.5
2  1.500000  1.500000  2.0
3  4.666667  3.666667  4.0
4  2.500000  4.500000  4.0
5  3.000000  3.000000  5.0

In [28]:
df.groupby('A').transform(lambda x: x-x.mean())
### the function has to return a dataframe of the same size
### the mean depends on the group and the column

          B         C    D
0  0.333333 -0.666667  1.0
1 -1.500000 -0.500000 -1.0
2  1.500000  0.500000  1.0
3  0.000000  0.000000  0.0
4 -0.500000 -0.500000 -0.5
5 -0.500000 -0.500000  1.0
6  0.500000  0.500000 -1.0
7 -0.666667  1.333333  0.0
8  0.500000  0.500000  0.5
9  0.333333 -0.666667 -1.0

In [30]:
df.groupby('A').apply(lambda x: x[['C','D']])
### the function can return anything

   C  D
0  3  5
1  4  3
2  5  5
3  3  5
4  2  3
5  1  3
6  2  1
7  5  4
8  3  4
9  3  3

Pivot table:  
Use two columns to separate the DataFrame

In [34]:
df.groupby(['A','B'])['C'].mean().unstack()

B    1    2    3    4    5
A
1  NaN  2.0  3.0  NaN  NaN
2  1.0  2.0  NaN  NaN  NaN
3  NaN  NaN  NaN  5.0  3.0
4  4.0  NaN  NaN  5.0  NaN
5  NaN  NaN  3.0  NaN  NaN

In [39]:
df.pivot_table('C', ### values we want
               index='A',
               columns='B',
               aggfunc='mean')  ### default 'mean'

B    1    2    3    4    5
A
1  NaN  2.0  3.0  NaN  NaN
2  1.0  2.0  NaN  NaN  NaN
3  NaN  NaN  NaN  5.0  3.0
4  4.0  NaN  NaN  5.0  NaN
5  NaN  NaN  3.0  NaN  NaN

In [40]:
import seaborn as sns
### installed on CoCalc (but you might have the internet)
### conda install seaborn --user
### pip install seaborn --user

In [41]:
data = sns.load_dataset('titanic')

In [42]:
data.shape

(891, 15)

In [44]:
data.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [45]:
data.groupby('sex')['survived'].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [47]:
(data['sex'] == 'female').sum()

314

In [48]:
data.pivot_table('survived', 
                index='sex', 
                columns='class',
                aggfunc='mean')

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [50]:
data.pivot_table('survived', 
                index='sex', 
                columns='class',
                aggfunc='mean',
                margins=True
                )

class      First    Second     Third       All
sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

String, text

In [52]:
'1' in 'jfo;iawjfksd'

False

In [53]:
list('joisdaj;flksdf')

['j', 'o', 'i', 's', 'd', 'a', 'j', ';', 'f', 'l', 'k', 's', 'd', 'f']

In [54]:
a = 'Jephian Lin'

In [57]:
a[0]

'J'

In [58]:
len(a)

11

In [63]:
a = 'Jephian Lin'

In [66]:
a.lower()

'jephian lin'

In [69]:
a.startswith('Ja')

False

In [74]:
a.endswith('Lee')

False

In [75]:
a.split()

['Jephian', 'Lin']

In [76]:
a = 'John, Lee, Lin'

In [79]:
a.split(', ')

['John', 'Lee', 'Lin']

# Regular expression
Use a **pattern** (but not a word) to search

In [80]:
import re

In [83]:
re.search('1', '111111')

In [84]:
re.search('1+', '11123123hwodfuh')

In [87]:
re.search('1{2,5}', 'jfoawie;fji1308rf79hd18o3idhuiwrfh')

In [90]:
re.search('words{0,1}', 'wordsssssss')

In [94]:
re.search('[123]{2,4}', 'alieufhil23fh983ijdfhui')

In [97]:
re.search('[A-Za-z]+', 'alieufhil23fh983ijdfhui')

The string method, or the vectorized string operations

In [98]:
s = pd.Series(['Jephian Lin',
              'Jeremy Lin', 
              'Joshua Wong', 
              'Bruce Lee', 
              'William Lai'])

In [101]:
s.str.lower()

0    jephian lin
1     jeremy lin
2    joshua wong
3      bruce lee
4    william lai
dtype: object

In [102]:
s.str.replace('Lin', 'Lee')

0    Jephian Lee
1     Jeremy Lee
2    Joshua Wong
3      Bruce Lee
4    William Lai
dtype: object

In [103]:
s.str.startswith('J')

0     True
1     True
2     True
3    False
4    False
dtype: bool

In [108]:
mask = s.str.startswith('J')

In [115]:
arr = np.random.randn(5,6)
df = pd.DataFrame(arr, 
                 index=s)
df

                    0         1         2         3         4         5
Jephian Lin  0.476905 -1.105140 -0.679114 -1.245873 -0.185048  0.778828
Jeremy Lin  -0.150372  0.263750  0.593984 -1.197318  0.658969 -1.029577
Joshua Wong -0.853625 -0.084650  2.002789 -0.615066 -0.723061  0.466619
Bruce Lee   -0.535459  2.052772 -0.803109 -0.630537  0.392302  0.088718
William Lai  0.917471 -0.941332 -0.089163 -0.706406  0.038640  1.288761

In [116]:
mask = df.index.str.startswith('J')

In [117]:
mask

array([ True,  True,  True, False, False])

In [118]:
df.loc[mask, :]

                    0        1         2         3         4         5
Jephian Lin  0.476905 -1.10514 -0.679114 -1.245873 -0.185048  0.778828
Jeremy Lin  -0.150372  0.26375  0.593984 -1.197318  0.658969 -1.029577
Joshua Wong -0.853625 -0.08465  2.002789 -0.615066 -0.723061  0.466619

Regular expression on pandas

In [120]:
s

0    Jephian Lin
1     Jeremy Lin
2    Joshua Wong
3      Bruce Lee
4    William Lai
dtype: object

In [121]:
s.str.split()

0    [Jephian, Lin]
1     [Jeremy, Lin]
2    [Joshua, Wong]
3      [Bruce, Lee]
4    [William, Lai]
dtype: object

In [124]:
s.str.split().str.get(0)

0    Jephian
1     Jeremy
2     Joshua
3      Bruce
4    William
dtype: object

In [125]:
s.str.extract('([A-Za-z]+)')

         0
0  Jephian
1   Jeremy
2   Joshua
3    Bruce
4  William

In [126]:
a = '123hjkds'

In [ ]:
a.

In [ ]:
re.